#+TITLE: \alsim, an associative learning simulator
#+AUTHOR: Stefano Ghirlanda
#+DATE: /Very preliminary version of \today/
#+OPTIONS: toc:nil ':t
#+PROPERTY: header-args:R :session *R* :colnames no :exports both :eval no-export
#+LATEX_CLASS_OPTIONS: [12pt,letterpaper]
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage[capitalize]{cleveref}
#+LATEX_HEADER: \usepackage{natbib}
#+LATEX_HEADER: \usepackage{array,xspace}
#+LATEX_HEADER: \usepackage[x11names,pdftex]{xcolor}
#+LATEX_HEADER: \usepackage[small]{titlesec}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[footnotesize]{caption}
#+LATEX_HEADER: \usepackage[shrink=30,stretch=0]{microtype}
#+LATEX_HEADER: \newcommand{\cites}[1]{\citeauthor{#1}'s (\citeyear{#1})}
#+LATEX_HEADER: \usepackage{url}
#+LATEX_HEADER: \urlstyle{rm}
#+LATEX_HEADER: \usepackage[scaled=0.75]{beramono}
#+LATEX_HEADER:\setminted{fontsize=\normalsize,linenos=true}
#+LATEX_HEADER: \newcommand\alsim{\texttt{Alsim}\xspace}

#+BEGIN_SRC R :exports none :tangle examples.R :results none
library(alsim)
#+END_SRC

* Stimulus representations

Generalization function will typically return different values for
different stimulus representations. Stimulus representations are thus
an integral part of modeling. For example, =pearce= (or any other
generalization function) will return zero if $A$ and $B$ have no
common elements:
#+BEGIN_SRC R :tangle no :results output :exports both
  A <- c(1,0)
  B <- c(0,1)
  pearce( "A", "B" )
#+END_SRC

#+RESULTS:
: [1] 0
But it will return non-zero values when common elements are assumed:
#+BEGIN_SRC R :tangle no :results output :exports both
  A <- c(1,0,1)
  B <- c(0,1,1)
  pearce( "A", "B" )
#+END_SRC

#+RESULTS:
: [1] 0.25

* Making your own

To add a model to \alsim, all you need to do is write a generalization
function. The generalization function must take as input two stimulus
names, as strings, and must return a single numeric value. There are
two possible approaches. The first is to operate on vector
representations of stimuli. The second is two operate on stimulus
names only. As an illustration of the first approach, imagine that you
want to add a silly model in which generalization depends only on the
first component of each vector. If they are equal, generalization is
1, otherwise it is 0. This is the way to do it:
#+BEGIN_SRC R :tangle no :results none :exports code
  silly <- function( X, Y ) {
      vX <- name2vec( X )
      vY <- name2vec( Y )
      if( vX[1] == vY[1] )
	  g <- 1
      else
	  g <- 0
      g
  }
#+END_SRC
Here, lines 2 and 3 retrieve the vector associated with the names =X=
and =Y=. To see =silly= at work, we first define some stimulus vectors:
#+BEGIN_SRC R :tangle no :results none :exports code
  X <- c(1,1)
  Y <- c(1,0)
  Z <- c(0,1)
#+END_SRC
After which we can try:
#+BEGIN_SRC R :tangle no :results output :exports both
  silly( "X", "Y" )
#+END_SRC

#+RESULTS:
: [1] 1
or:
#+BEGIN_SRC R :tangle no :results output :exports both
  silly( "X", "Y" )
#+END_SRC

#+RESULTS:
: [1] 1
Note that =silly= fails if the vector is not defined:
#+BEGIN_SRC R :tangle no :results output :exports both
  silly( "X", "undefined stimulus name" )
#+END_SRC

#+RESULTS:
: Error in get(X, pos = 1, mode = "numeric") : 
:   object 'undefined stimulus name' of mode 'numeric' was not found

The second approach to writing generalization functions does not
relying on defining vectors, but rather it assigns generalization
values to named stimuli directly. If you want/need to take this route,
here is a template:
#+BEGIN_SRC R :tangle no :results none :exports code
  manual <- function( X, Y ) {
      known <- c("A","B","AB")

      if( !( X %in% known ) || !( Y %in% known ) )
	  stop(paste(
	      "use only known stimuli:",
	      paste(known,collapse=" ")
	  ) )

      g <- matrix( 0, nrow=3, ncol=3 )
      rownames(g) <- known
      colnames(g) <- known
      g["A","A"] <- g["B","B"] <- g["AB","AB"] <- 1
      g["A","B"] <- g["B","A"] <- 0
      g["A","AB"] <- g["AB","A"] <- 1/2
      g["B","AB"] <- g["AB","B"] <- 1/2

      g[X,Y]
  }
#+END_SRC
This defines generalization only between =A=, =B=, and =AB=. For
example:
#+BEGIN_SRC R :tangle no :results output :exports both
  manual( "A", "AB" )
#+END_SRC

#+RESULTS:
: [1] 0.5
But:
#+BEGIN_SRC R :tangle no :results output :exports both
  manual( "A", "C" )
#+END_SRC

#+RESULTS:
: Error in manual("A", "C") : use only known stimuli: A B AB

* Code                                                             :noexport:

#+NAME: document
#+BEGIN_SRC sh :exports none :eval no-export :results output :tangle no
sudo Rscript -e "devtools::document('alsim')"
#+END_SRC

#+RESULTS: document
: Writing V.Rd
: Writing newModel.Rd
: Writing trial.Rd

#+NAME: build
#+BEGIN_SRC sh :exports none :eval no-export :results output :tangle no
sudo Rscript -e "devtools::build('alsim')"
#+END_SRC

#+RESULTS: build
: * checking for file ‘/home/stefano/Dropbox/Science/Active/alsim/alsim/DESCRIPTION’ ... OK
: * preparing ‘alsim’:
: * checking DESCRIPTION meta-information ... OK
: * checking for LF line-endings in source and make files and shell scripts
: * checking for empty or unneeded directories
: * looking to see if a ‘data/datalist’ file should be added
: * building ‘alsim_0.1.tar.gz’
: [1] "/home/stefano/Dropbox/Science/Active/alsim/alsim_0.1.tar.gz"

#+NAME: install
#+BEGIN_SRC sh :exports none :eval no-export :results output :tangle no
sudo Rscript -e "devtools::install('alsim')"
#+END_SRC

#+RESULTS: install

